practice_003.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Practice #003</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><a href="index.html">Problem Solving</a></nav><div id="content" class="content">
<h1 class="title">Practice #003</h1>
<ul class="org-ul">
<li>Time Spent: 41 minutes 33 seconds</li>
<li>Time Allotted: 1 hour</li>
<li>Completed: July 2, 2022 1:51 PM</li>
</ul>

<div id="outline-container-org5cd1ebe" class="outline-2">
<h2 id="org5cd1ebe"><a href="leetcode_788_rotated_digits.html#ID-5947D4EE-1CDA-4718-8EE9-3FE9979C986F">Leetcode: 788. Rotated Digits</a></h2>
<div class="outline-text-2" id="text-org5cd1ebe">
<ul class="org-ul">
<li>Cons

<ul class="org-ul">
<li>Rushed to code instead of verifying what makes a number valid or not.  The final code was different from the initial version, since it wasn't necessary to store the digits to check if a number after transformation was valid or not.</li>

<li>Had to calm down and start from scratch when the solution started to become unnecessarily complicated.</li>
</ul></li>

<li>Pros

<ul class="org-ul">
<li>Thought about the solution to generate the valid numbers, but discarded it since the constraints allowed an \(O(n \times \log(n))\) solution.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org5ba20e1" class="outline-2">
<h2 id="org5ba20e1"><a href="leetcode_849_maximize_distance_to_closest_person.html#ID-32919D8E-D3F6-452D-920C-91145D44350A">Leetcode: 849. Maximize Distance to Closest Person</a></h2>
<div class="outline-text-2" id="text-org5ba20e1">
<ul class="org-ul">
<li>Pros

<ul class="org-ul">
<li>Implemented how to compute the distance to the next left one and after that saw that I could use the same algorithm to compute the distance to the next right by reverting the input.</li>
</ul></li>
</ul>
</div>
</div>
</div>
</body>
</html>